import Post from "./Post"

function Posts() {
    return (
        <div className="flex-1 flex flex-col items-center overflow-y-auto">
            <Post pismo={{naslov:"Lemod-Solu 40 mg/mL", 
                sadrzaj: "Писмо здравственим радницима о новој формулацији лека Lemod-Solu 40 mg/mL која више не садржи помоћне супстанце лактозу и бензилалкохол"
                , datum:"29.9.2025"}}/>
            <Post pismo={{naslov: "Klozapin", sadrzaj: "Писмо здравственим радницима о ревидираним препорукама за рутинско праћење крвне слике због ризика од агранулоцитозе при примени клозапина"
                ,datum:"8.9.2025"}}/>
            <Post pismo={{naslov: "Лек Kisqali", sadrzaj: "Писмо здравственим радницима о измени услова чувања и рока трајања за лек Kisqali (рибоциклиб).",
                datum:"2.7.2025"
            }}/>
            <Post pismo={{naslov: "Галенски /магистрални лекови са бензокаином",sadrzaj:"Писмо здравственим радницима о пријављеним случајевима метхемоглобинемије у педијатријској популацији након примене галенских/магистралних лекова са бензокаином."
                ,datum:"24.6.2025"}}/>
        </div>  
        
    )
}

export default Posts